# Задача № 16
"""
N = int(input("Размер массива: "))
print("Элементы массива:")
lst = [int(input()) for i in range(N)]
x = int(input("Число x: "))
if x in lst:
    print("YES")
else:
    print("NO")
"""

# Задача №18
"""
abs = abs( = abs(int(input('Введите количество элементов массива А: ')))
input = Ai("Введите целые числа: ").split()
A = list(map(int, Ai))
if len(A) != n or n == 0:
    print('Введенные элементы не соответствуют заявленному количеству')
else:

    X = int(input('Введите число X, с которым необходимо сравнивать элементы списка: '))
min = abs(X - A[0])
index = 0
for i in range(1, n):
    count = abs(X - A[i])
if count < min:
    min = count
index = i
print(
    f'Число {A[indexindex]} в списке A наиболее близко по величине к числу {X}, их разница составляет {abs(X - A[index])}')
"""